<?
$i = 0;
$obl = ['Московская Область' => ['Москва','Зеленоград','Клин'], 'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],'Рязанская область' => ['Рязань','Шацк','Шилово','Сасово','Касимов']];

/*Цикл вывод ассоативного массива*/
foreach ($obl as $key => $value){
    echo "$key:<br>";
    $i=0;
    $counter = count($value)-1;
    foreach($value as $val){
        if ($i==$counter){
            echo "$val";
            
            }
        else{
        echo "$val, ";
    }
    $i++;
    }
    echo "<br>";
}