<?
$menu = ["Главная" => [],"Сведения об образовательной организации" => ["Основные сведения","Структура и органы управления", "Документы", "Образование"], "Виртуальный кабинет" => ["Новости", "Нормативно-правовое обеспечение","Уголок профориентационной работы","Знакомство с профессией"], "Родителям" => [],"Новости" => ["2018 год", "2019 год"], "Карта сайта" => []];
echo "<ul>";
foreach ($menu as $key => $value){
    echo "<li><a href=\"#\">$key</a><ul>";
    foreach ($value as $val){
        echo "<li><a href=\"#\">$val</a></li>";
    }
    echo "</ul></li>";
}
echo "</ul>";